InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/SYSCTL/Header/Peripheral/Register/RegisterDefines/SYSCTL_RegisterDefines_RCGC.h
/**
 *
 * @file SYSCTL_RegisterDefines_RCGC.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 24 jun. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 24 jun. 2020     vyldram    1.0         initial Version@endverbatim
 */
#ifndef XDRIVER_MCU_DRIVER_HEADER_SYSCTL_SYSCTL_PERIPHERAL_SYSCTL_REGISTER_SYSCTL_REGISTERDEFINES_SYSCTL_REGISTERDEFINES_RCGC_H_
#define XDRIVER_MCU_DRIVER_HEADER_SYSCTL_SYSCTL_PERIPHERAL_SYSCTL_REGISTER_SYSCTL_REGISTERDEFINES_SYSCTL_REGISTERDEFINES_RCGC_H_

#include <stdint.h>

/******************************************************************************************
************************************58 RCGCWD *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_RCGCWD_R_WDT0_MASK         ((uint32_t)0x00000001u)
#define SYSCTL_RCGCWD_R_WDT0_BIT          (0u)
#define SYSCTL_RCGCWD_R_WDT0_DIS    ((uint32_t)0x00000000u)
#define SYSCTL_RCGCWD_R_WDT0_EN      ((uint32_t)0x00000001u)

#define SYSCTL_RCGCWD_WDT0_MASK           ((uint32_t)0x00000001u)
#define SYSCTL_RCGCWD_WDT0_DIS      ((uint32_t)0x00000000u)
#define SYSCTL_RCGCWD_WDT0_EN        ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCWD_R_WDT1_MASK         ((uint32_t)0x00000002u)
#define SYSCTL_RCGCWD_R_WDT1_BIT          (1u)
#define SYSCTL_RCGCWD_R_WDT1_DIS    ((uint32_t)0x00000000u)
#define SYSCTL_RCGCWD_R_WDT1_EN      ((uint32_t)0x00000002u)

#define SYSCTL_RCGCWD_WDT1_MASK           ((uint32_t)0x00000001u)
#define SYSCTL_RCGCWD_WDT1_DIS      ((uint32_t)0x00000000u)
#define SYSCTL_RCGCWD_WDT1_EN        ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************59 RCGCTIMER *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_RCGCTIMER_R_TIMER0_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_RCGCTIMER_R_TIMER0_BIT         (0u)
#define SYSCTL_RCGCTIMER_R_TIMER0_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCTIMER_R_TIMER0_EN     ((uint32_t)0x00000001u)

#define SYSCTL_RCGCTIMER_TIMER0_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCTIMER_TIMER0_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCTIMER_TIMER0_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCTIMER_R_TIMER1_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_RCGCTIMER_R_TIMER1_BIT         (1u)
#define SYSCTL_RCGCTIMER_R_TIMER1_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCTIMER_R_TIMER1_EN     ((uint32_t)0x00000002u)

#define SYSCTL_RCGCTIMER_TIMER1_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCTIMER_TIMER1_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCTIMER_TIMER1_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCTIMER_R_TIMER2_MASK        ((uint32_t)0x00000004u)
#define SYSCTL_RCGCTIMER_R_TIMER2_BIT         (2u)
#define SYSCTL_RCGCTIMER_R_TIMER2_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCTIMER_R_TIMER2_EN     ((uint32_t)0x00000004u)

#define SYSCTL_RCGCTIMER_TIMER2_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCTIMER_TIMER2_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCTIMER_TIMER2_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCTIMER_R_TIMER3_MASK        ((uint32_t)0x00000008u)
#define SYSCTL_RCGCTIMER_R_TIMER3_BIT         (3u)
#define SYSCTL_RCGCTIMER_R_TIMER3_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCTIMER_R_TIMER3_EN     ((uint32_t)0x00000008u)

#define SYSCTL_RCGCTIMER_TIMER3_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCTIMER_TIMER3_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCTIMER_TIMER3_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCTIMER_R_TIMER4_MASK        ((uint32_t)0x00000010u)
#define SYSCTL_RCGCTIMER_R_TIMER4_BIT         (4u)
#define SYSCTL_RCGCTIMER_R_TIMER4_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCTIMER_R_TIMER4_EN     ((uint32_t)0x00000010u)

#define SYSCTL_RCGCTIMER_TIMER4_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCTIMER_TIMER4_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCTIMER_TIMER4_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCTIMER_R_TIMER5_MASK        ((uint32_t)0x00000020u)
#define SYSCTL_RCGCTIMER_R_TIMER5_BIT         (5u)
#define SYSCTL_RCGCTIMER_R_TIMER5_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCTIMER_R_TIMER5_EN     ((uint32_t)0x00000020u)

#define SYSCTL_RCGCTIMER_TIMER5_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCTIMER_TIMER5_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCTIMER_TIMER5_EN       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************60 RCGCGPIO *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_RCGCGPIO_R_GPIOA_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_RCGCGPIO_R_GPIOA_BIT         (0u)
#define SYSCTL_RCGCGPIO_R_GPIOA_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_R_GPIOA_EN     ((uint32_t)0x00000001u)

#define SYSCTL_RCGCGPIO_GPIOA_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCGPIO_GPIOA_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_GPIOA_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCGPIO_R_GPIOB_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_RCGCGPIO_R_GPIOB_BIT         (1u)
#define SYSCTL_RCGCGPIO_R_GPIOB_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_R_GPIOB_EN     ((uint32_t)0x00000002u)

