InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/SYSCTL/Header/Peripheral/Register/RegisterDefines/SYSCTL_RegisterDefines_RCGC.h
#define SYSCTL_RCGCGPIO_GPIOB_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCGPIO_GPIOB_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_GPIOB_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCGPIO_R_GPIOC_MASK        ((uint32_t)0x00000004u)
#define SYSCTL_RCGCGPIO_R_GPIOC_BIT         (2u)
#define SYSCTL_RCGCGPIO_R_GPIOC_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_R_GPIOC_EN     ((uint32_t)0x00000004u)

#define SYSCTL_RCGCGPIO_GPIOC_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCGPIO_GPIOC_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_GPIOC_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCGPIO_R_GPIOD_MASK        ((uint32_t)0x00000008u)
#define SYSCTL_RCGCGPIO_R_GPIOD_BIT         (3u)
#define SYSCTL_RCGCGPIO_R_GPIOD_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_R_GPIOD_EN     ((uint32_t)0x00000008u)

#define SYSCTL_RCGCGPIO_GPIOD_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCGPIO_GPIOD_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_GPIOD_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCGPIO_R_GPIOE_MASK        ((uint32_t)0x00000010u)
#define SYSCTL_RCGCGPIO_R_GPIOE_BIT         (4u)
#define SYSCTL_RCGCGPIO_R_GPIOE_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_R_GPIOE_EN     ((uint32_t)0x00000010u)

#define SYSCTL_RCGCGPIO_GPIOE_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCGPIO_GPIOE_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_GPIOE_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCGPIO_R_GPIOF_MASK        ((uint32_t)0x00000020u)
#define SYSCTL_RCGCGPIO_R_GPIOF_BIT         (5u)
#define SYSCTL_RCGCGPIO_R_GPIOF_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_R_GPIOF_EN     ((uint32_t)0x00000020u)

#define SYSCTL_RCGCGPIO_GPIOF_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCGPIO_GPIOF_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_GPIOF_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCGPIO_R_GPIOG_MASK        ((uint32_t)0x00000040u)
#define SYSCTL_RCGCGPIO_R_GPIOG_BIT         (6u)
#define SYSCTL_RCGCGPIO_R_GPIOG_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_R_GPIOG_EN     ((uint32_t)0x00000040u)

#define SYSCTL_RCGCGPIO_GPIOG_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCGPIO_GPIOG_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_GPIOG_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCGPIO_R_GPIOG_MASK        ((uint32_t)0x00000040u)
#define SYSCTL_RCGCGPIO_R_GPIOG_BIT         (6u)
#define SYSCTL_RCGCGPIO_R_GPIOG_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_R_GPIOG_EN     ((uint32_t)0x00000040u)

#define SYSCTL_RCGCGPIO_GPIOG_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCGPIO_GPIOG_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_GPIOG_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCGPIO_R_GPIOH_MASK        ((uint32_t)0x00000080u)
#define SYSCTL_RCGCGPIO_R_GPIOH_BIT         (7u)
#define SYSCTL_RCGCGPIO_R_GPIOH_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_R_GPIOH_EN     ((uint32_t)0x00000080u)

#define SYSCTL_RCGCGPIO_GPIOH_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCGPIO_GPIOH_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_GPIOH_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCGPIO_R_GPIOJ_MASK        ((uint32_t)0x00000100u)
#define SYSCTL_RCGCGPIO_R_GPIOJ_BIT         (8u)
#define SYSCTL_RCGCGPIO_R_GPIOJ_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_R_GPIOJ_EN     ((uint32_t)0x00000100u)

#define SYSCTL_RCGCGPIO_GPIOJ_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCGPIO_GPIOJ_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_GPIOJ_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCGPIO_R_GPIOK_MASK        ((uint32_t)0x00000200u)
#define SYSCTL_RCGCGPIO_R_GPIOK_BIT         (9u)
#define SYSCTL_RCGCGPIO_R_GPIOK_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_R_GPIOK_EN     ((uint32_t)0x00000200u)

#define SYSCTL_RCGCGPIO_GPIOK_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCGPIO_GPIOK_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_GPIOK_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCGPIO_R_GPIOL_MASK        ((uint32_t)0x00000400u)
#define SYSCTL_RCGCGPIO_R_GPIOL_BIT         (10u)
#define SYSCTL_RCGCGPIO_R_GPIOL_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_R_GPIOL_EN     ((uint32_t)0x00000400u)

#define SYSCTL_RCGCGPIO_GPIOL_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCGPIO_GPIOL_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_GPIOL_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCGPIO_R_GPIOM_MASK        ((uint32_t)0x00000800u)
#define SYSCTL_RCGCGPIO_R_GPIOM_BIT         (11u)
#define SYSCTL_RCGCGPIO_R_GPIOM_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_R_GPIOM_EN     ((uint32_t)0x00000800u)

#define SYSCTL_RCGCGPIO_GPIOM_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCGPIO_GPIOM_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_GPIOM_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCGPIO_R_GPION_MASK        ((uint32_t)0x00001000u)
#define SYSCTL_RCGCGPIO_R_GPION_BIT         (12u)
#define SYSCTL_RCGCGPIO_R_GPION_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_R_GPION_EN     ((uint32_t)0x00001000u)

#define SYSCTL_RCGCGPIO_GPION_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCGPIO_GPION_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_GPION_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCGPIO_R_GPIOP_MASK        ((uint32_t)0x00002000u)
#define SYSCTL_RCGCGPIO_R_GPIOP_BIT         (13u)
#define SYSCTL_RCGCGPIO_R_GPIOP_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_R_GPIOP_EN     ((uint32_t)0x00002000u)

