InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/SYSCTL/Header/Peripheral/Register/RegisterDefines/SYSCTL_RegisterDefines_RCGC.h
#define SYSCTL_RCGCGPIO_GPIOP_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCGPIO_GPIOP_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_GPIOP_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCGPIO_R_GPIOQ_MASK        ((uint32_t)0x00004000u)
#define SYSCTL_RCGCGPIO_R_GPIOQ_BIT         (14u)
#define SYSCTL_RCGCGPIO_R_GPIOQ_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_R_GPIOQ_EN     ((uint32_t)0x00004000u)

#define SYSCTL_RCGCGPIO_GPIOQ_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCGPIO_GPIOQ_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCGPIO_GPIOQ_EN       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************61 RCGCDMA *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_RCGCDMA_R_UDMA_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_RCGCDMA_R_UDMA_BIT         (0u)
#define SYSCTL_RCGCDMA_R_UDMA_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCDMA_R_UDMA_EN     ((uint32_t)0x00000001u)

#define SYSCTL_RCGCDMA_UDMA_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCDMA_UDMA_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCDMA_UDMA_EN       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************62 RCGCHIB *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_RCGCHIB_R_HIB_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_RCGCHIB_R_HIB_BIT         (0u)
#define SYSCTL_RCGCHIB_R_HIB_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCHIB_R_HIB_EN     ((uint32_t)0x00000001u)

#define SYSCTL_RCGCHIB_HIB_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCHIB_HIB_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCHIB_HIB_EN       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************63 RCGCUART *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_RCGCUART_R_UART0_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_RCGCUART_R_UART0_BIT         (0u)
#define SYSCTL_RCGCUART_R_UART0_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCUART_R_UART0_EN     ((uint32_t)0x00000001u)

#define SYSCTL_RCGCUART_UART0_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCUART_UART0_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCUART_UART0_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCUART_R_UART1_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_RCGCUART_R_UART1_BIT         (1u)
#define SYSCTL_RCGCUART_R_UART1_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCUART_R_UART1_EN     ((uint32_t)0x00000002u)

#define SYSCTL_RCGCUART_UART1_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCUART_UART1_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCUART_UART1_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCUART_R_UART2_MASK        ((uint32_t)0x00000004u)
#define SYSCTL_RCGCUART_R_UART2_BIT         (2u)
#define SYSCTL_RCGCUART_R_UART2_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCUART_R_UART2_EN     ((uint32_t)0x00000004u)

#define SYSCTL_RCGCUART_UART2_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCUART_UART2_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCUART_UART2_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCUART_R_UART3_MASK        ((uint32_t)0x00000008u)
#define SYSCTL_RCGCUART_R_UART3_BIT         (3u)
#define SYSCTL_RCGCUART_R_UART3_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCUART_R_UART3_EN     ((uint32_t)0x00000008u)

#define SYSCTL_RCGCUART_UART3_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCUART_UART3_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCUART_UART3_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCUART_R_UART4_MASK        ((uint32_t)0x00000010u)
#define SYSCTL_RCGCUART_R_UART4_BIT         (4u)
#define SYSCTL_RCGCUART_R_UART4_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCUART_R_UART4_EN     ((uint32_t)0x00000010u)

#define SYSCTL_RCGCUART_UART4_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCUART_UART4_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCUART_UART4_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCUART_R_UART5_MASK        ((uint32_t)0x00000020u)
#define SYSCTL_RCGCUART_R_UART5_BIT         (5u)
#define SYSCTL_RCGCUART_R_UART5_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCUART_R_UART5_EN     ((uint32_t)0x00000020u)

#define SYSCTL_RCGCUART_UART5_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCUART_UART5_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCUART_UART5_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCUART_R_UART6_MASK        ((uint32_t)0x00000040u)
#define SYSCTL_RCGCUART_R_UART6_BIT         (6u)
#define SYSCTL_RCGCUART_R_UART6_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCUART_R_UART6_EN     ((uint32_t)0x00000040u)

#define SYSCTL_RCGCUART_UART6_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCUART_UART6_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCUART_UART6_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCUART_R_UART7_MASK        ((uint32_t)0x00000080u)
#define SYSCTL_RCGCUART_R_UART7_BIT         (7u)
#define SYSCTL_RCGCUART_R_UART7_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCUART_R_UART7_EN     ((uint32_t)0x00000080u)

#define SYSCTL_RCGCUART_UART7_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCUART_UART7_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCUART_UART7_EN       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************64 RCGCSSI *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_RCGCSSI_R_SSI0_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_RCGCSSI_R_SSI0_BIT         (0u)
#define SYSCTL_RCGCSSI_R_SSI0_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCSSI_R_SSI0_EN     ((uint32_t)0x00000001u)

#define SYSCTL_RCGCSSI_SSI0_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCSSI_SSI0_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCSSI_SSI0_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCSSI_R_SSI1_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_RCGCSSI_R_SSI1_BIT         (1u)
#define SYSCTL_RCGCSSI_R_SSI1_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCSSI_R_SSI1_EN     ((uint32_t)0x00000002u)

