InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/SYSCTL/Header/Peripheral/Register/RegisterDefines/SYSCTL_RegisterDefines_RCGC.h
#define SYSCTL_RCGCSSI_SSI1_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCSSI_SSI1_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCSSI_SSI1_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCSSI_R_SSI2_MASK        ((uint32_t)0x00000004u)
#define SYSCTL_RCGCSSI_R_SSI2_BIT         (2u)
#define SYSCTL_RCGCSSI_R_SSI2_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCSSI_R_SSI2_EN     ((uint32_t)0x00000004u)

#define SYSCTL_RCGCSSI_SSI2_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCSSI_SSI2_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCSSI_SSI2_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCSSI_R_SSI3_MASK        ((uint32_t)0x00000008u)
#define SYSCTL_RCGCSSI_R_SSI3_BIT         (3u)
#define SYSCTL_RCGCSSI_R_SSI3_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCSSI_R_SSI3_EN     ((uint32_t)0x00000008u)

#define SYSCTL_RCGCSSI_SSI3_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCSSI_SSI3_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCSSI_SSI3_EN       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************65 RCGCI2C *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_RCGCI2C_R_I2C0_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_RCGCI2C_R_I2C0_BIT         (0u)
#define SYSCTL_RCGCI2C_R_I2C0_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCI2C_R_I2C0_EN     ((uint32_t)0x00000001u)

#define SYSCTL_RCGCI2C_I2C0_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCI2C_I2C0_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCI2C_I2C0_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCI2C_R_I2C1_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_RCGCI2C_R_I2C1_BIT         (1u)
#define SYSCTL_RCGCI2C_R_I2C1_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCI2C_R_I2C1_EN     ((uint32_t)0x00000002u)

#define SYSCTL_RCGCI2C_I2C1_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCI2C_I2C1_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCI2C_I2C1_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCI2C_R_I2C2_MASK        ((uint32_t)0x00000004u)
#define SYSCTL_RCGCI2C_R_I2C2_BIT         (2u)
#define SYSCTL_RCGCI2C_R_I2C2_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCI2C_R_I2C2_EN     ((uint32_t)0x00000004u)

#define SYSCTL_RCGCI2C_I2C2_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCI2C_I2C2_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCI2C_I2C2_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCI2C_R_I2C3_MASK        ((uint32_t)0x00000008u)
#define SYSCTL_RCGCI2C_R_I2C3_BIT         (3u)
#define SYSCTL_RCGCI2C_R_I2C3_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCI2C_R_I2C3_EN     ((uint32_t)0x00000008u)

#define SYSCTL_RCGCI2C_I2C3_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCI2C_I2C3_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCI2C_I2C3_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCI2C_R_I2C4_MASK        ((uint32_t)0x00000010u)
#define SYSCTL_RCGCI2C_R_I2C4_BIT         (4u)
#define SYSCTL_RCGCI2C_R_I2C4_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCI2C_R_I2C4_EN     ((uint32_t)0x00000010u)

#define SYSCTL_RCGCI2C_I2C4_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCI2C_I2C4_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCI2C_I2C4_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCI2C_R_I2C5_MASK        ((uint32_t)0x00000020u)
#define SYSCTL_RCGCI2C_R_I2C5_BIT         (5u)
#define SYSCTL_RCGCI2C_R_I2C5_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCI2C_R_I2C5_EN     ((uint32_t)0x00000020u)

#define SYSCTL_RCGCI2C_I2C5_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCI2C_I2C5_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCI2C_I2C5_EN       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************66 RCGCUSB *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_RCGCUSB_R_USB_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_RCGCUSB_R_USB_BIT         (0u)
#define SYSCTL_RCGCUSB_R_USB_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCUSB_R_USB_EN     ((uint32_t)0x00000001u)

#define SYSCTL_RCGCUSB_USB_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCUSB_USB_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCUSB_USB_EN       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************67 RCGCCAN *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_RCGCCAN_R_CAN0_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_RCGCCAN_R_CAN0_BIT         (0u)
#define SYSCTL_RCGCCAN_R_CAN0_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCCAN_R_CAN0_EN     ((uint32_t)0x00000001u)

#define SYSCTL_RCGCCAN_CAN0_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCCAN_CAN0_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCCAN_CAN0_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCCAN_R_CAN1_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_RCGCCAN_R_CAN1_BIT         (1u)
#define SYSCTL_RCGCCAN_R_CAN1_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCCAN_R_CAN1_EN     ((uint32_t)0x00000002u)

#define SYSCTL_RCGCCAN_CAN1_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCCAN_CAN1_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCCAN_CAN1_EN       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************68 RCGCADC *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_RCGCADC_R_ADC0_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_RCGCADC_R_ADC0_BIT         (0u)
#define SYSCTL_RCGCADC_R_ADC0_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCADC_R_ADC0_EN     ((uint32_t)0x00000001u)

#define SYSCTL_RCGCADC_ADC0_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCADC_ADC0_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCADC_ADC0_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCADC_R_ADC1_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_RCGCADC_R_ADC1_BIT         (1u)
#define SYSCTL_RCGCADC_R_ADC1_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCADC_R_ADC1_EN     ((uint32_t)0x00000002u)

