InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/SYSCTL/Header/Peripheral/Register/RegisterDefines/SYSCTL_RegisterDefines_RCGC.h
#define SYSCTL_RCGCADC_ADC1_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCADC_ADC1_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCADC_ADC1_EN       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************69 RCGCACMP *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_RCGCACMP_R_ACMP_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_RCGCACMP_R_ACMP_BIT         (0u)
#define SYSCTL_RCGCACMP_R_ACMP_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCACMP_R_ACMP_EN     ((uint32_t)0x00000001u)

#define SYSCTL_RCGCACMP_ACMP_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCACMP_ACMP_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCACMP_ACMP_EN       ((uint32_t)0x00000001u)
/*--------*/

/****************************************************************************************
************************************70 RCGCPWM *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_RCGCPWM_R_PWM0_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_RCGCPWM_R_PWM0_BIT         (0u)
#define SYSCTL_RCGCPWM_R_PWM0_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCPWM_R_PWM0_EN     ((uint32_t)0x00000001u)

#define SYSCTL_RCGCPWM_PWM0_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCPWM_PWM0_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCPWM_PWM0_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCPWM_R_PWM1_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_RCGCPWM_R_PWM1_BIT         (1u)
#define SYSCTL_RCGCPWM_R_PWM1_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCPWM_R_PWM1_EN     ((uint32_t)0x00000002u)

#define SYSCTL_RCGCPWM_PWM1_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCPWM_PWM1_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCPWM_PWM1_EN       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************71 RCGCQEI *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_RCGCQEI_R_QEI0_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_RCGCQEI_R_QEI0_BIT         (0u)
#define SYSCTL_RCGCQEI_R_QEI0_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCQEI_R_QEI0_EN     ((uint32_t)0x00000001u)

#define SYSCTL_RCGCQEI_QEI0_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCQEI_QEI0_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCQEI_QEI0_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCQEI_R_QEI1_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_RCGCQEI_R_QEI1_BIT         (1u)
#define SYSCTL_RCGCQEI_R_QEI1_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCQEI_R_QEI1_EN     ((uint32_t)0x00000002u)

#define SYSCTL_RCGCQEI_QEI1_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCQEI_QEI1_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCQEI_QEI1_EN       ((uint32_t)0x00000001u)
/*--------*/

/******************************************************************************************
************************************72 RCGCEEPROM *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_RCGCEEPROM_R_EEPROM_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_RCGCEEPROM_R_EEPROM_BIT         (0u)
#define SYSCTL_RCGCEEPROM_R_EEPROM_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCEEPROM_R_EEPROM_EN     ((uint32_t)0x00000001u)

#define SYSCTL_RCGCEEPROM_EEPROM_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCEEPROM_EEPROM_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCEEPROM_EEPROM_EN       ((uint32_t)0x00000001u)
/*--------*/

/**********************************************************************************
************************************73 RCGCWTIMER *********************************************
******************************************************************************************/
/*--------*/
#define SYSCTL_RCGCWTIMER_R_WTIMER0_MASK        ((uint32_t)0x00000001u)
#define SYSCTL_RCGCWTIMER_R_WTIMER0_BIT         (0u)
#define SYSCTL_RCGCWTIMER_R_WTIMER0_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCWTIMER_R_WTIMER0_EN     ((uint32_t)0x00000001u)

#define SYSCTL_RCGCWTIMER_WTIMER0_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCWTIMER_WTIMER0_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCWTIMER_WTIMER0_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCWTIMER_R_WTIMER1_MASK        ((uint32_t)0x00000002u)
#define SYSCTL_RCGCWTIMER_R_WTIMER1_BIT         (1u)
#define SYSCTL_RCGCWTIMER_R_WTIMER1_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCWTIMER_R_WTIMER1_EN     ((uint32_t)0x00000002u)

#define SYSCTL_RCGCWTIMER_WTIMER1_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCWTIMER_WTIMER1_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCWTIMER_WTIMER1_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCWTIMER_R_WTIMER2_MASK        ((uint32_t)0x00000004u)
#define SYSCTL_RCGCWTIMER_R_WTIMER2_BIT         (2u)
#define SYSCTL_RCGCWTIMER_R_WTIMER2_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCWTIMER_R_WTIMER2_EN     ((uint32_t)0x00000004u)

#define SYSCTL_RCGCWTIMER_WTIMER2_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCWTIMER_WTIMER2_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCWTIMER_WTIMER2_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCWTIMER_R_WTIMER3_MASK        ((uint32_t)0x00000008u)
#define SYSCTL_RCGCWTIMER_R_WTIMER3_BIT         (3u)
#define SYSCTL_RCGCWTIMER_R_WTIMER3_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCWTIMER_R_WTIMER3_EN     ((uint32_t)0x00000008u)

#define SYSCTL_RCGCWTIMER_WTIMER3_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCWTIMER_WTIMER3_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCWTIMER_WTIMER3_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCWTIMER_R_WTIMER4_MASK        ((uint32_t)0x00000010u)
#define SYSCTL_RCGCWTIMER_R_WTIMER4_BIT         (4u)
#define SYSCTL_RCGCWTIMER_R_WTIMER4_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCWTIMER_R_WTIMER4_EN     ((uint32_t)0x00000010u)

#define SYSCTL_RCGCWTIMER_WTIMER4_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCWTIMER_WTIMER4_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCWTIMER_WTIMER4_EN       ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define SYSCTL_RCGCWTIMER_R_WTIMER5_MASK        ((uint32_t)0x00000020u)
#define SYSCTL_RCGCWTIMER_R_WTIMER5_BIT         (5u)
#define SYSCTL_RCGCWTIMER_R_WTIMER5_DIS   ((uint32_t)0x00000000u)
#define SYSCTL_RCGCWTIMER_R_WTIMER5_EN     ((uint32_t)0x00000020u)

#define SYSCTL_RCGCWTIMER_WTIMER5_MASK          ((uint32_t)0x00000001u)
#define SYSCTL_RCGCWTIMER_WTIMER5_DIS     ((uint32_t)0x00000000u)
#define SYSCTL_RCGCWTIMER_WTIMER5_EN       ((uint32_t)0x00000001u)
/*--------*/

#endif /* XDRIVER_MCU_DRIVER_HEADER_SYSCTL_SYSCTL_PERIPHERAL_SYSCTL_REGISTER_SYSCTL_REGISTERDEFINES_SYSCTL_REGISTERDEFINES_RCGC_H_ */
